* DONE visitas clientes
- State "DONE"       from "TODO"       [2019-03-04 lun 20:19]
se remodelo lo relativo a poner el numero de cobrador antes.
y que se vaya generando un archivo de visitas aparte, para que no se
vaya borrando el trabajo que se habia hecho atras.
** DONE hacer mas adelante los pivot en base a la tabla visitas
- State "DONE"       from "TODO"       [2019-03-04 lun 20:19]
* DONE [2019-02-28 jue] poner <w> y coloreado verde/azul en gestion/antiguos
* DONE [2019-02-21 jue] ver que al agregar una calle no se actualiza el combo para incluirla
* DONE [2019-02-19 mar] verificar si aparece en listado el numero de wapp
* DONE [2019-02-13 mié] tabla que registre las visitas de promocion
- State "DONE"       from "TODO"       [2019-03-05 mar 13:28]
pq el registro en clientes es estatico y luego al hacer revisitas en
especial con vendedor diferente se pierde la estadistica. 
seria una tbl visitas(id,promo,fpromo)
ahora habria que hacer que se carguen las visitas cada vez que se
imprime el listado.
* DONE [2019-02-06 mié] chequear y poner (o sacar) LN desde recibos
- State "DONE"       from "TODO"       [2019-02-11 lun 14:44]
* DONE [2019-02-05 mar] hacer que el mensaje para wapp se genere tambien en buscador
- State "DONE"       from "TODO"       [2019-02-11 lun 14:45]
* DONE [2019-02-04 lun] habilitar la periodicidad quincenal
- State "DONE"       from              [2019-02-04 lun 17:20]
- State "DONE"       from "TODO"       [2019-02-04 lun 17:20]
chequear cuenta 71291
* TODO [2019-02-12 mar] crear una consulta para saber lo cobrado en planes de pagos
* DONE [2019-02-12 mar] editador de detvta
- State "DONE"       from "TODO"       [2019-04-09 mar 19:31]
continuar con la labor de editar ventas 
* TODO [2019-02-06 mié] crear un sistema de registro de las autorizaciones 
** en buscador facil puede ser un boton
registra dia/hora automatica y maquina que la proceso
tendria que anotar con un boton el vdor que la pidio y si se aprobo o
rechazo y por cuanto se aprobo.
En el caso de las del seven estaria bueno cargarlas y cargar el
infoseven, 
* TODO [2019-02-06 mié] mejoras en pasador ventas
** un tbls de calle-num en direccion para chequear direccion
* TODO [2019-02-04 lun] stock mejoras al programa
** vista sin los que tienen saldo cero 
** posibilidad de editar los costos en la tabla de stock
** impresion de stock
** vista de totales de mercaderia en stock
* TODO [2019-03-05 mar] sistema mas agil de pasado de venta
ya que las ventas las pasare yo pienso qeu lo que conviene es pasarlas
a mil por hora o sea que el sistema de control que tengo con lapicera
sirva para controlar pero que  el pasado sea lo mas automatizado
posible. P.e. un pasado por botones en art puede ser muy rapido
comparado ese bloque de combo que es muy lento. y es el lugar donde
mas lento se me pone. 
* TODO [2019-03-07 jue] que tendria que tener ventas nuevo
** DONE solucionar tema sexo, con botones pq ese combo es cumbersome
- State "DONE"       from "TODO"       [2019-04-09 mar 19:33]
es muy molesto
** DONE pararse en los botones
- State "DONE"       from "TODO"       [2019-03-07 jue 16:07]
Documentacion de pararse en los botones:
bind .guardar <<Enter>> {+balloon %W "Presione espacio para procesar"
5000 orange3;break}
donde .guardar es el nombre del boton a parar.
** DONE resaltar con color los campos que controlo
- State "DONE"       from "TODO"       [2019-03-07 jue 16:18]
simplemente hice bind al paso por <<Enter>> y luego los limpio cuando
agrego cliente nuevo.
** tener articulos con boton
tabla de manejo de packs
packs con idpacks nmemotecnico con pocas letras
faltaria la creacion de los botones

** DONE tener wapp articulado
- State "DONE"       from "TODO"       [2019-03-07 jue 16:38]
hice dos controles camponum para wasap uno prefijo de limite 4 para
contener el 3512 y otro de limite 8 para el 411963, luego en el
guardar los uni concatenando los gets.
Hecho tambien el viceversa o sea la lectura en el proc cargarcliente,
que era antes muy elegante solo cargando la variable cliente como
array, y haciendo depender todos los widgets a elementos del array.
En este caso globalizo las dos variables wass1/2 que estan detras de
las partes del wass y con string range parto el wassap de la base y lo
presento en los dos camposnum cuando se abre un registro.

** solucionar tema combo que se traba con ituizango ituizango anexo pe.
** pegar con boton derecho para nombre proveniente de seven
* TODO [2019-03-08 vie] hacer tab Sectores en Fichas2
para procesar fichas por Sector 1 y 2 (u otros)
Los sectores serian como megazonas y no estarian asignadas a nadie
se mostraria un resumen.
Primero mostrar resumen de cuanto hay para cobrar por sector y por
zona. Vencido a la fecha.
* DONE [2019-03-26 mar] sacar fts de buscador y cambiarla por busqueda simple
- State "DONE"       from "TODO"       [2019-03-26 mar 18:00]
formato nombre%calle%num%barrio%zona%aclaracion
** DONE exploracion basica 
- State "DONE"       from "TODO"       [2019-03-26 mar 18:00]
:LOGBOOK:
CLOCK: [2019-03-26 mar 16:19]--[2019-03-26 mar 17:42] =>  1:23
:END:
Se logro sacar todo vestigio del FTS5.
se cambio el engorroso sistema de dependencia a la generacion de una
tabla anexa FTS5, lo cual era un error conceptual pq de hacerlo en
cada arranque insumia mas de 3 segundos y era inaceptable y uno se
olvidaba de hacerlo a mano. 
Luego toda la versatilidad del FTS no se usaba. apenas se usaba una
busqueda simple de calle y numero o nombre, o el numero de dni o
cuenta.
Ahora los numeros son mas concretos, ya que dni y telefono se hacen el
el cuadro buscar y cuenta y rbo en sus cuadros correspondientes, lo
cual evita tener que poner un prefijo y es el mismo engorro a nivel
usuario.
La diferencia a favor del sistema actual es la busqueda parcial la no
necesidad de tener que poner el nombre completo de calle o apellido,
la posibilidad de empalmar partes. La unica condicion respetar el
orden logico de nombre-calle-num-barrio-zona-aclaracion-mjecobr.
Supongamos el caso Usuhaia 1978 salta al toque, incluso saltaria la
direccion si esta en el mjecobr tambien. 
Como el arreglo de la cadena de busqueda lo hice en el proc
buscarresultado casi la estructura se mantuvo y no tuve que hacer
grandes cambios y se mantuvo todo igual.
Otra cosa que se corrigio aparentemente es el problema de caracteres
no permitidos por FTS5 cuando se hace la rebusqueda por calle/num. 

** DONE [2019-03-12 mar] caso Usuahia 1978 en buscador
- State "DONE"       from "TODO"       [2019-03-26 mar 18:00]
si lo busco por calle numero no me aparece o sea me da direccion sana
pq no es cliente, pero la direccion esta mencionada en un comentario,
pero si lo busco en busqueda abierta me salta un dato valioso en
comentario, estaria bueno que mas en direccion capte esas cosas. 
** DONE [2019-01-23 mié] sacar fts de buscador y poner combo
- State "DONE"       from "TODO"       [2019-03-26 mar 18:16]
* DONE [2019-03-12 mar] poner wapp en buscador
- State "DONE"       from "TODO"       [2019-03-26 mar 18:13]
:LOGBOOK:
CLOCK: [2019-03-26 mar 18:02]--[2019-03-26 mar 18:13] =>  0:11
:END:
poner wapp en datos1 al lado de tel y hacer ambos editables
* DONE [2019-01-31 jue] arreglar impresion lotes 
- State "DONE"       from "TODO"       [2019-03-26 mar 19:08]
:LOGBOOK:
CLOCK: [2019-03-26 mar 18:17]--[2019-03-26 mar 19:08] =>  0:51
:END:
securitizar el ingreso del cobrador y permitir el cambio de cobrador
sin tener que cambiar el lote entero.

Reparado: se pudo un label con el nombre del cobrador grande para que
sea dificil equivocarse y se cambio el campo que limpie los numeros
cosa que se pueda cambiar el nombre del cobrador sin perder lo
ingresado.
* DONE [2019-04-05 vie] periodicidad ventas
- State "DONE"       from "TODO"       [2019-07-01 lun 14:28]
chequear en pasado de ventas que pasa con la periodicidad y de paso
ver que no se puede editar periodicidad en editar ventas.
lo del pasado es pq el combo es un combo itk y tendria que ser un
combo comun, pq uno se olvida el funcionamiento.
* DONE [2019-04-05 vie] editar articulos en edicion de ventas
- State "DONE"       from "TODO"       [2019-04-08 lun 21:24]
borrado y agregado de articulos
* DONE [2019-04-05 vie] edicion con borrado y agregado de articulos
- State "DONE"       from "TODO"       [2019-04-08 lun 16:58]
o en general para no tener que recurrir a fichaje.py
* TODO [2019-04-05 vie] interface de agregado de promotores/cobradores
* DONE [2019-04-08 lun] modifico la busqueda de num cuenta en buscador
- State "DONE"       from "TODO"       [2019-04-08 lun 15:44]
pq se hacia molesto la costumbre de poner el numero de cuenta en el
campo buscar y que no te la busque. 
Lo hice con un elif ya que el campo buscar original luego se
transforma en cadbuscar intercalandole los % o sea que cuando ponemos
un numero de cuenta de 5 cifras el buscar es puro y una regexp lo
captura.
La regexp es 
regexp {^[0-9]{5}$ $buscar} eso permite poniendola como primer opcion
que sigan funcionando las opciones de busqueda de dni y telefono.
* TODO [2019-04-10 mié] cuando alguien cancele que no se genere saldo negativo
y mucho menos que tenga seven.
* DONE [2019-04-24 mié] corregir bug recorridos
- State "DONE"       from "TODO"       [2019-04-27 sáb 12:49]
* DONE [2019-04-27 sáb] bug Asia 1623
- State "DONE"       from "TODO"       [2019-07-17 mié 16:59]
:LOGBOOK:
CLOCK: [2019-07-17 mié 16:55]--[2019-07-17 mié 16:59] =>  0:04
:END:
ver porque en el buscador no aparece una clienta que debe desde el
2013 en el buscador y si aparece en el F13 y si aparece en el
autorizador.
Se cierra el bug sin resolverlo pq en este ejemplo en particular si
aparecen en el buscador las dos clientas que hay en asia 1623.

* DONE [2019-05-11 sáb] saldo no suma las entregas
- State "DONE"       from "TODO"       [2019-07-17 mié 17:02]
p.e. id 72179 presenta saldo 2370 cuando es 1870 sumando sus cuotas
bug solucionado por la correccion del trigger CalculaSaldoUP 
* DONE [2019-07-02 mar] caso Tognali Roxana en Antiguos
- State "DONE"       from "TODO"       [2019-07-02 mar 14:44]
verificar la condicion que lleva a la inclusion en antiguos y que esa
condicion tenga en cuenta el ultpago.
EL pasaje a antiguos se realizaba con el campo pmovto pero si por
error una cuenta de pago reciente no actualizaba su pmovto lo mismo
era pasada a antiguos, agregando un par de condiciones arreglamos esto
* TODO [2019-09-03 mar] caso 66542 deuda no corresponde para un plan de pagos
el plan de pagos parece correcto pero la deuda calculada es incorrecta.
* TODO [2019-09-11 mié] caso 74271 devolvio pero seguia mostrando deuda 1920
pienso que se hizo pq la cuenta tenia pagos a favor y luego de la
cancelacion se borran los recibos y eso gatilla trigger de calculo de
saldo que se hace por tabla ventas y ese triger no tiene en cuenta el
campo devolucion.
* TODO [2019-09-11 mié] devoluciones dejar zona y poner LN
* TODO [2019-09-11 mié] en fichas2 consulta de pagaron hoy
para poder fechar los visitar que esten atrasados.
* TODO [2019-09-13 vie] pmovto en plan quincenal no anda
* TODO [2019-09-13 vie] hacer la red no internet dependiente
hacerla por medio de un router
* TODO [2019-09-23 lun] bug 30120908
poner 74579 y luego poner 30120908 ahi saltan dos bugs uno que las
ventas de la cuenta anterior quedan visibles y el problema del array
colores para las ventas devueltas que tienen cuota pagada.
